"Aw crap" = "Aw rahat";
"Back" = "Înapoi";
"Half full" = "Pe jumătate plin";
"How ya feeling today?" = "Cum te simți azi?";
"Live half full." = "Trăi pe jumătate plin.";
"Loading..." = "Se încarcă ...";
"Next" = "Următor";
"No internet connection" = "Nici o conexiune la internet";
"OK" = "Bine";
"Patience is a virtue." = "Răbdarea este o virtute.";
"Share to Facebook" = "Distribuiți pe Facebook";
"Share to Twitter" = "Distribuiți pe Twitter";
"Sorry, this quote is too long to post to Twitter." = "Ne pare rău, acest citat este de prea mult timp pentru a posta pe Twitter.";
"The app that turns your frown upside down with a dose of inspiration to kick any bad mood in the butt!" = "App care se încrunta cu susul în jos, cu o doză de inspirație pentru a lovi cu piciorul orice stare de spirit proastă în fund!";
"The glass is always" = "Sticla este întotdeauna";
"The quote hasn't loaded yet." = "Citat nu a încărcat încă.";
"Try Again" = "Încercați din nou";
"Whoops" = "Hopa";
"don't be angry." = "supărat";
"don't be impatient." = "nerăbdător";
"don't be tired." = "obosit";
"don't be lonely." = "singuratic";
"don't be depressed." = "deprimat";
"don't be guilty." = "vinovat";
"don't be sad." = "trist";
"don't be nostalgic." = "nostalgic";
"don't be jealous." = "gelos";
"don't be dull." = "plictisitor";
"don't be scared." = "frică";
"don't be anxious." = "nerăbdător";
"angry" = "supărat";
"impatient" = "nerăbdător";
"tired" = "obosit";
"lonely" = "singuratic";
"depressed" = "deprimat";
"guilty" = "vinovat";
"sad" = "trist";
"nostalgic" = "nostalgic";
"jealous" = "gelos";
"dull" = "plictisitor";
"scared" = "frică";
"anxious" = "nerăbdător";
